In [9]:
import pandas as pd

In [10]:
df = pd.read_csv('sample2 (1).csv',encoding='ANSI')

In [11]:
df_new = pd.DataFrame([],columns=['seahawks','philadelphia'])
for indx,line in enumerate(df['evaluations']):
    try:
        list_dict = line.replace('\xa0','')
        list_dict = eval(list_dict)

        scores = [elem['score'] for elem in list_dict]

        df_new.loc[len(df_new)] = scores
    except:
        print(f'Error in line {indx}')

In [12]:
df_new

  seahawks philadelphia
0     2514         2514
1    25000        30000